app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`, `remember_token`) VALUES ('as;dfnas;dfn', 'alsdkfn@ss.ru', '$2a$10$cUr1.IDCna9ArKC1saTKru9kO4Vw9h7TXJiTuOHGZP5/xg9uNt8wy', '2015-03-15 13:25:42.478565', '2015-03-15 13:25:42.478565', 'c5518678b1bfea8c33d3d857c55acb1c8e7edb41')
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `name` = 'New Name', `email` = 'new@example.com', `password_digest` = '$2a$04$W5k8Z2B7G/19N0.7EtVCruAVRxvWwrkuLavHABXplAPQaZlnZoHcK', `updated_at` = '2015-04-01 20:11:24.813507' WHERE `users`.`id` = 295
---
	def update
		@user = User.find(params[:id])
		if @user.update_attributes(user_params)